01  WS-AREA. 
    05  WS-VAR1 PIC 9(5) VALUE 0. 
    05  WS-VAR2 PIC 9(5) VALUE 0. 

* Some COBOL code... 

ADD 1 TO WS-VAR1. 
ADD WS-VAR1 TO WS-VAR2. 
DISPLAY "WS-VAR1: " WS-VAR1. 
DISPLAY "WS-VAR2: " WS-VAR2.